Revit 2026 API

# ElementIsPhaseDemolishedValid Method

---

Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPhaseDemolishedValid(
	ElementId demolishedPhaseId
)
```
```vb
Public Function IsPhaseDemolishedValid (
	demolishedPhaseId As ElementId
) As Boolean
```
```cpp
public:
bool IsPhaseDemolishedValid(
	ElementId^ demolishedPhaseId
)
```
```fsharp
member IsPhaseDemolishedValid :
        demolishedPhaseId : ElementId -> bool
```

#### Parameters

demolishedPhaseId ElementId
     The id of a Phase or invalidElementId.

#### Return Value

Boolean True if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Acts as a validator for setting the property DemolishedPhaseId.

#### Reference

Element Class

Autodesk.Revit.DB Namespace